---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemIsStructuralMaterial
source: html/9aa35599-5e7e-0fc9-03e4-59aff30c3d80.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemIsStructuralMaterial Property

"Is Structural Material"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemIsStructuralMaterial { get; }
```